In [1]:
import pandas as pd
# Create a Series from a list
data = [10, 20, 30, 40, 50]
s = pd.Series(data)

In [2]:
s[2]

30

In [3]:
s.iloc[2]

30

In [4]:
s[1:4]

1    20
2    30
3    40
dtype: int64

In [5]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 28],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [7]:
df['Name']

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [10]:
df.iloc[0]

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [11]:
df.loc[0]

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [12]:
df[1:3]

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [15]:
df['Age'].unique()

array([25, 30, 35, 28])

In [16]:
df[df['Age'] > 25]

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [17]:
df.to_csv('trading_data.csv', index=False)